## Pandas 1

In [ ]:
import pandas as pd
import numpy as np

In [2]:
# series
import pandas as pd
import numpy as np


ls = [1,2,3,4,7,8]
ls2 = [3,4,5,6]
print('python native list: ', ls)
arr = np.array(ls)
arr2 = np.array(ls2)
print('numpy array: ', arr)
ser = pd.Series(arr)
ser2 = pd.Series(arr2)
print('pandas series:', ser)

python native list:  [1, 2, 3, 4, 7, 8]
numpy array:  [1 2 3 4 7 8]
pandas series: 0    1
1    2
2    3
3    4
4    7
5    8
dtype: int64

In [15]:
print(ser[0])
print(ser[1])
print(ser[0:2])
print(ser[0::2])

1
2
0    1
1    2
dtype: int64
0    1
2    3
dtype: int64

In [21]:
print(ser.mean())
print(ser.min())
print(ser.max())

2.5
1
4

In [32]:
print(ser + ser2)
print(ser - ser2)
print(ser * ser2)
print(ser / ser2)

0     4.0
1     6.0
2     8.0
3    10.0
4     NaN
5     NaN
dtype: float64
0   -2.0
1   -2.0
2   -2.0
3   -2.0
4    NaN
5    NaN
dtype: float64
0     3.0
1     8.0
2    15.0
3    24.0
4     NaN
5     NaN
dtype: float64
0    0.333333
1    0.500000
2    0.600000
3    0.666667
4         NaN
5         NaN
dtype: float64

In [36]:
filt = ser % 2 == 0
filt1 = (ser > 3) & (ser < 7)
print(ser[filt])
print(ser[filt1])

1    2
3    4
5    8
dtype: int64
3    4
dtype: int64

In [38]:
ser.describe()

count    6.000000
mean     4.166667
std      2.786874
min      1.000000
25%      2.250000
50%      3.500000
75%      6.250000
max      8.000000
dtype: float64

In [3]:
data = {
        "id": [1,2,3,4,5,6,7],
        "name": ['mukhlisa', 'samandar', 'nodir', 'nabohat', 'inobat', 'muhammadbotir', 'najmiddin'],
        "python_mid_score": [90, 80, 95, 85, 95, 85, 80]
        }

data

{'id': [1, 2, 3, 4, 5, 6, 7],
 'name': ['mukhlisa',
  'samandar',
  'nodir',
  'nabohat',
  'inobat',
  'muhammadbotir',
  'najmiddin'],
 'python_mid_score': [90, 80, 95, 85, 95, 85, 80]}

In [4]:
df = pd.DataFrame(data)
df

   id           name  python_mid_score
0   1       mukhlisa                90
1   2       samandar                80
2   3          nodir                95
3   4        nabohat                85
4   5         inobat                95
5   6  muhammadbotir                85
6   7      najmiddin                80

In [50]:
ser[1]

np.int64(2)

In [51]:
df[0]

KeyError: 0

In [53]:
df.head(3)

   id      name  python_mid_score
0   1  mukhlisa                90
1   2  samandar                80
2   3     nodir                95

In [56]:
df.tail(2)

   id           name  python_mid_score
5   6  muhammadbotir                85
6   7      najmiddin                80

In [59]:
df.columns

Index(['id', 'name', 'python_mid_score'], dtype='object')

In [67]:
df["name"]

0         mukhlisa
1         samandar
2            nodir
3          nabohat
4           inobat
5    muhammadbotir
6        najmiddin
Name: name, dtype: object

In [68]:
df[["id", "name"]]

   id           name
0   1       mukhlisa
1   2       samandar
2   3          nodir
3   4        nabohat
4   5         inobat
5   6  muhammadbotir
6   7      najmiddin

In [71]:
print(type(df["name"]))
print(type(df[["id", "name"]]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [74]:
df * 2

   id                        name  python_mid_score
0   2            mukhlisamukhlisa               180
1   4            samandarsamandar               160
2   6                  nodirnodir               190
3   8              nabohatnabohat               170
4  10                inobatinobat               190
5  12  muhammadbotirmuhammadbotir               170
6  14          najmiddinnajmiddin               160

In [6]:
filt = df['python_mid_score'] > 80
df[filt]

   id           name  python_mid_score
0   1       mukhlisa                90
2   3          nodir                95
3   4        nabohat                85
4   5         inobat                95
5   6  muhammadbotir                85

In [8]:
df['sql_mid_score'] = 80
df

   id           name  python_mid_score  sql_mid_score
0   1       mukhlisa                90             80
1   2       samandar                80             80
2   3          nodir                95             80
3   4        nabohat                85             80
4   5         inobat                95             80
5   6  muhammadbotir                85             80
6   7      najmiddin                80             80

In [ ]:

df['name'][0] = 'Mukhlisa' #not recommended
df

C:\Users\Inobat\AppData\Local\Temp\ipykernel_9076\941829969.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['name'][0] = 'Mukhlisa'
C:\Users\Inobat\AppData\Local\Temp\ipykernel_9076\941829969.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][0] = 'Mukhlisa'

   id           name  python_mid_score  sql_mid_score
0   1       Mukhlisa                90             80
1   2       samandar                80             80
2   3          nodir                95             80
3   4        nabohat                85             80
4   5         inobat                95             80
5   6  muhammadbotir                85             80
6   7      najmiddin                80             80

In [ ]:
# better to change with at

df.at[5,'name'] = 'Muhammadbotir'
df

   id           name  python_mid_score  sql_mid_score
0   1       Mukhlisa                90             80
1   2       samandar                80             80
2   3          nodir                95             80
3   4        nabohat                85             80
4   5         inobat                95             80
5   6  Muhammadbotir                85             80
6   7      najmiddin                80             80

In [ ]:
# rename returns new dataframe
# to affect existing one either inplace=True or equal to variable itself

df.rename(columns={'name': 'Name'})

   id           Name  python_mid_score  sql_mid_score
0   1       Mukhlisa                90             80
1   2       samandar                80             80
2   3          nodir                95             80
3   4        nabohat                85             80
4   5         inobat                95             80
5   6  Muhammadbotir                85             80
6   7      najmiddin                80             80

In [23]:
df.rename(columns={'name': 'Name'},inplace=True)
df

   id           Name  python_mid_score  sql_mid_score
0   1       Mukhlisa                90             80
1   2       samandar                80             80
2   3          nodir                95             80
3   4        nabohat                85             80
4   5         inobat                95             80
5   6  Muhammadbotir                85             80
6   7      najmiddin                80             80

In [24]:
df =df.rename(columns={'name': 'Name'})
df

   id           Name  python_mid_score  sql_mid_score
0   1       Mukhlisa                90             80
1   2       samandar                80             80
2   3          nodir                95             80
3   4        nabohat                85             80
4   5         inobat                95             80
5   6  Muhammadbotir                85             80
6   7      najmiddin                80             80

In [25]:
df[0:2]

   id      Name  python_mid_score  sql_mid_score
0   1  Mukhlisa                90             80
1   2  samandar                80             80

In [ ]:
df = pd.read_csv('mavie.csv')
df.head(1)

,Color,Director,Duration,IMDB_Rating,Votes,Revenue,Actor,Metascore,Gross,Genres
0,Color,Alex Gibney,48.0,9.3,141.0,23.0,George W. Bush,141.0,274661.0,Crime|Documentary|War

In [29]:
# label --- appearance-- ['mukhlisa', 'samandar', 'nodir', 'nabohat', 'inobat', 'muhammadbotir', 'najmiddin'] - tashqi ko'rinish
# index --- position -- [0,1,2,3,4,5,6], 
# loc --- label
# iloc --- position

In [31]:
df.head(10)

,Color,Director,Duration,IMDB_Rating,Votes,Revenue,Actor,Metascore,Gross,Genres
0,Color,Alex Gibney,48.0,9.3,141.0,23.0,George W. Bush,141.0,274661.0,Crime|Documentary|War
1,Color,Paul Crowder,3.0,97.0,10.0,5.0,Marv Albert,102.0,144431.0,Documentary|Sport
2,Color,Rohit Jagessar,120.0,8.0,0.0,0.0,Rufus Graham,12.0,227241.0,Drama
3,Color,Griffin Dunne,13.0,90.0,165.0,679.0,Fisher Stevens,978.0,112521.0,Comedy|Drama
4,Color,Anthony Powell,31.0,91.0,9.0,9.0,Tom Hamann,53.0,287761.0,Adventure|Biography|Documentary
5,Color,Kief Davidson,43.0,93.0,0.0,0.0,Brian Whitaker,20.0,100240.0,Documentary
6,Color,Johnny Remo,2.0,112.0,74.0,891.0,Randy Wayne,260000.0,96734.0,Action|Drama
7,Color,Vivek Agnihotri,4.0,106.0,5.0,219.0,Anil Kapoor,724.0,49000.0,Thriller
8,Color,Ti West,238.0,95.0,243.0,725.0,Greta Gerwig,969.0,100659.0,Horror
9,Color,Nick Tomnay,112.0,93.0,11.0,271.0,Clayne Crawford,443.0,48430.0,Comedy|Crime|Thriller

In [39]:
# first row, then column

df.loc[0:3, 'Director':'Votes']

         Director  Duration  IMDB_Rating  Votes
0     Alex Gibney      48.0          9.3  141.0
1    Paul Crowder       3.0         97.0   10.0
2  Rohit Jagessar     120.0          8.0    0.0
3   Griffin Dunne      13.0         90.0  165.0

In [ ]:
df = df.set_index('Director')
df

,Color,Duration,IMDB_Rating,Votes,Revenue,Actor,Metascore,Gross,Genres
Director,,,,,,,,,
Alex Gibney,Color,48.0,9.3,141.0,23.0,George W. Bush,141.0,274661.0,Crime|Documentary|War
Paul Crowder,Color,3.0,97.0,10.0,5.0,Marv Albert,102.0,144431.0,Documentary|Sport
Rohit Jagessar,Color,120.0,8.0,0.0,0.0,Rufus Graham,12.0,227241.0,Drama
Griffin Dunne,Color,13.0,90.0,165.0,679.0,Fisher Stevens,978.0,112521.0,Comedy|Drama
Anthony Powell,Color,31.0,91.0,9.0,9.0,Tom Hamann,53.0,287761.0,Adventure|Biography|Documentary
...,...,...,...,...,...,...,...,...,...
James Cameron,Color,96.0,7.9,128477.0,472627.0,Meryl Streep,883.0,21725.0,Horror|Mystery
Christopher Nolan,Color,116.0,6.2,29502.0,5263.0,Robert Downey Jr.,277.0,182900.0,Action|Adventure
Martin Scorsese,Color,130.0,7.6,404980.0,298881.0,Meryl Streep,485.0,165445.0,Comedy|Drama
Steven Spielberg,Color,113.0,8.3,150422.0,22172.0,Tom Hanks,380.0,58276.0,Horror|Mystery
Christopher Nolan,Color,99.0,7.0,465671.0,223320.0,Scarlett Johansson,816.0,233071.0,Sci-Fi|Thriller

In [48]:
df.loc['Paul Crowder':'Anthony Powell', 'Duration':'Votes']

                Duration  IMDB_Rating  Votes
Director
Paul Crowder         3.0         97.0   10.0
Rohit Jagessar     120.0          8.0    0.0
Griffin Dunne       13.0         90.0  165.0
Anthony Powell      31.0         91.0    9.0

In [51]:
df = df.reset_index()
df

,index,Director,Color,Duration,IMDB_Rating,Votes,Revenue,Actor,Metascore,Gross,Genres
0,0,Alex Gibney,Color,48.0,9.3,141.0,23.0,George W. Bush,141.0,274661.0,Crime|Documentary|War
1,1,Paul Crowder,Color,3.0,97.0,10.0,5.0,Marv Albert,102.0,144431.0,Documentary|Sport
2,2,Rohit Jagessar,Color,120.0,8.0,0.0,0.0,Rufus Graham,12.0,227241.0,Drama
3,3,Griffin Dunne,Color,13.0,90.0,165.0,679.0,Fisher Stevens,978.0,112521.0,Comedy|Drama
4,4,Anthony Powell,Color,31.0,91.0,9.0,9.0,Tom Hamann,53.0,287761.0,Adventure|Biography|Documentary
...,...,...,...,...,...,...,...,...,...,...,...
155,155,James Cameron,Color,96.0,7.9,128477.0,472627.0,Meryl Streep,883.0,21725.0,Horror|Mystery
156,156,Christopher Nolan,Color,116.0,6.2,29502.0,5263.0,Robert Downey Jr.,277.0,182900.0,Action|Adventure
157,157,Martin Scorsese,Color,130.0,7.6,404980.0,298881.0,Meryl Streep,485.0,165445.0,Comedy|Drama
158,158,Steven Spielberg,Color,113.0,8.3,150422.0,22172.0,Tom Hanks,380.0,58276.0,Horror|Mystery
159,159,Christopher Nolan,Color,99.0,7.0,465671.0,223320.0,Scarlett Johansson,816.0,233071.0,Sci-Fi|Thriller